app/controllers/airlines_slas_controller.rb

  def index
    @airlines_slas = AirlinesSla.select(:airline_code).group(:airline_code)
---
SELECT "airlines_slas"."airline_code" FROM "airlines_slas" GROUP BY "airlines_slas"."airline_code"  ORDER BY "airlines_slas"."airline_code" ASC