app/controllers/questionnaires_controller.rb

  def show
    @questionnaires = Questionnaire.where(:evaluation_id => params[:id], evaluation_type: params[:evaluation_type])
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."evaluation_id" IS NULL AND "questionnaires"."evaluation_type" IS NULL