app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."staff_id" IS NULL LIMIT 1
---
  def create
    # user = User.find_by(email: params[:session][:email].downcase)
    user = User.find_by(staff_id: params[:session][:staff_id])