app/controllers/sla_evaluations_controller.rb

  def index
    if logged_in?
      @sla_evaluations = current_user.sla_evaluations
    else
      @sla_evaluations = SlaEvaluation.first(20)
---
SELECT  "sla_evaluations".* FROM "sla_evaluations"  ORDER BY "sla_evaluations"."created_at" DESC LIMIT 20