app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id = 762146111)  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 762146111]]
---
  def home
    if logged_in?
      @micropost  = current_user.microposts.build
      @cs_evaluation = current_user.cs_evaluations.build
      @feed_items = current_user.feed.paginate(page: params[:page])