app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2016-04-18 12:50:15.033888"], ["id", 762146111]]
---
  def update
    if @user.update_attributes(user_params)